#### SolidCurveIntersection Members

---

|  |
| --- |
| SolidCurveIntersection Class   Methods   Properties   See Also |

The  SolidCurveIntersection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SolidCurveIntersection |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetCurveSegment | Gets the curve segment generated by intersection. |
| Public method | GetCurveSegmentExtents | Gets the extents for the given curve segment generated by intersection. |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ResultType | The result type used to calculate the intersections. |
| Public property | SegmentCount | The number of segments in the results. |

# See Also

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace